//-------------------------------------------------------------------------*
// 文件名: ftm.h                                                          *
// 说  明: ftm驱动头文件                                                  *
//-------------------------------------------------------------------------*

#ifndef __FTM_H__
#define __FTM_H__
#include "common.h"
    //-------------------------------------------------------------------------*
    //函数名: hw_FTM_init                                                        *
    //功  能: 初始化hw_FTM_init                                                       * 
    //参  数: 无                                                      *                                 *
    //返  回: 无                                                               *
    //说  明: A12 A13 B18 B19 为PWM输出口频率为50HZ                                                               *
    //-------------------------------------------------------------------------*
void hw_FTM_init();
    //-------------------------------------------------------------------------*
    //函数名: set_pwm                                                        *
    //功  能: 设置输出占空比1ms-2ms                                                      * 
    //参  数: a,b,c,d 范围(1000-2000)                                                      *                                 *
    //返  回: 无                                                               *
    //说  明: 输出1ms到2ms的pwm波形，控制电调                                                              *
    //-------------------------------------------------------------------------*
void set_pwm(uint16 a,uint16 b,uint16 c,uint16 d);

void SteerPWM_init();

uint8 ftm0_pwm_init(uint32 freq);
uint8 ftm0_pwm_open(uint8 channel, uint32 duty);
uint8 ftm0_pwm_change_duty(uint8 channel, uint32 duty);



#endif 
