//============================================================================
//文件名称：hw_gpio.h
//功能概要：K60 GPIO底层驱动程序头文件
//版权所有：苏州大学飞思卡尔嵌入式中心(sumcu.suda.edu.cn)
//版本更新：2011-11-13  V1.0   初始版本
//         2011-11-17  V1.1   规范排版风格
//         2011-12-16  V1.2   （1）去掉冗余代码；
//                            （2）调整函数声明顺序；
//                            （3）进一步规范注释
//============================================================================

#ifndef _GPIO_H
#define _GPIO_H

//包含头文件
#include "common.h"          //包含公共类型定义
	
//宏定义
//2.3 置位、清位、获得寄存器一位的状态
#define BSET(bit,Register)  ((Register)|= (1<<(bit)))    //置寄存器的一位
#define BCLR(bit,Register)  ((Register) &= ~(1<<(bit)))  //清寄存器的一位
#define BGET(bit,Register)  (((Register) >> (bit)) & 1)  //获得寄存器一位的状态
//芯片端口名定义
#define PORT_MAX_NUM 5  //端口数量(保留给RTOS使用)

//各GPIO口统一名称:PORT_A、 PORT_B、 PORT_C、 PORT_D、PORT_E
#define PORT_A   0      
#define PORT_B   1
#define PORT_C   2
#define PORT_D   3
#define PORT_E   4
#define PORTA (PORTA_BASE_PTR)//PORT_MemMapPtr
#define PORTB (PORTB_BASE_PTR)
#define PORTC (PORTC_BASE_PTR)
#define PORTD (PORTD_BASE_PTR)
#define PORTE (PORTE_BASE_PTR)
//=================函数接口声明===============================================

//============================================================================
//函数名称：hw_gpio_init
//函数返回：函数执行状态。0=成功，其它为异常。
//参数说明：port：端口号。由宏定义。
//          pin：引脚号。0～31。
//          dir：引脚方向。 1=输出，0=输入。
//          state：引脚初始状态。1=高电平，0=低电平
//功能概要：初始化端口作为GPIO引脚的功能。
//============================================================================
uint8 hw_gpio_init(uint8 port, uint8 pin, uint8 dir, uint8 state);

//============================================================================
//函数名称：hw_gpio_set
//函数返回：无
//参数说明：port：端口号。由宏定义。
//          pin：引脚号。0～31。
//          state：引脚初始状态。1=高电平，0=低电平
//功能概要：获取指定引脚状态。
//============================================================================
void hw_gpio_set(uint8 port, uint8 pin, uint8 state);

//============================================================================
//函数名称：hw_gpio_get
//函数返回：指定引脚状态。0=低电平，1=高电平。
//参数说明：port：端口号。由宏定义。
//          pin：引脚号。0～31。
//功能概要：获取指定引脚状态。
//============================================================================
uint8 hw_gpio_get(uint8 port, uint8 pin);

//============================================================================
//函数名称：hw_gpio_reverse
//函数返回：无
//参数说明：port：端口号。由宏定义。
//          pin：引脚号。0～31。
//功能概要：反转指定引脚状态。
//============================================================================
void hw_gpio_reverse(uint8 port, uint8 pin);

#endif
