#ifndef PIT_H_
#define PIT_H_

    //1 头文件
    #include "common.h"

#define PIT0 0
#define PIT1 1
#define PIT2 2
#define PIT3 3    
#define T 2.5
//==========================================================================
//函数名称: hw_pit_init                                                         
//函数返回: 无                                          
//参数说明: pitno:表示pit通道号。  
//			timeout:表示定时溢出开始递减的值          
//功能概要: 设置相关寄存器的值        
//==========================================================================
 void hw_pit_init(uint8 pitno,uint32 timeout);
 
//==========================================================================
//函数名: enable_pit_interrupt                                                     
//函数返回: 无                                              
//参数说明: pitno: 表示pit通道号      
//功能概要: 开接收引脚的IRQ中断                                                      

                                               
//==========================================================================
    void enable_pit_interrupt(uint8 pitno);

//==========================================================================
//函数名: disable_pit_interrupt                                                     
//函数返回: 无                                              
//参数说明: pitno: 表示pit通道号      
//功能概要: 开接收引脚的IRQ中断                                                      

                                               
//==========================================================================
    void disable_pit_interrupt(uint8 pitno);  


 #endif 
